# Duct Pressure Drop Data Properties

Source: https://www.revitapidocs.com/2026/717e198d-7f26-0f63-2c93-2a630f4c1013.htm

---

| Duct Pressure Drop Data Properties |
| --- |

The DuctPressureDropData type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | CategoryId | The category id of duct curves. It will be OST\_DuctCurves, OST\_FlexDuctCurves, or OST\_PlaceHolderDucts. |
|  | Coefficient | The coefficient of the duct. |
|  | Density | The density of the duct. Units: (kg/ft³). |
|  | DynamicViscosity | The dynamic viscosity of the air in the duct. Units: (kg/(ft\*s)). |
|  | Flow | The flow of the duct. Units: (ft³/s). |
|  | Friction | The friction of the duct. Units: (kg/(ft²·s²)). |
|  | Height | The height of the duct. If the duct is round, it will be equal to the diameter of the duct. Units: (ft). |
|  | HydraulicDiameter | The hydraulic diameter of the duct. Units: (ft). |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Length | The length of the duct. Units: (ft). |
|  | Level | The calculation level of the system. |
|  | PressureDrop | The pressure drop of the duct. Units: (kg/(ft·s²)). |
|  | ReynoldsNumber | The reynolds number of the duct. |
|  | Roughness | The roughness of the duct. Units: (ft). |
|  | Shape | The profile type of the duct. |
|  | Velocity | The velocity of the duct. Units: (ft/s). |
|  | VelocityPressure | The velocity pressure of the duct. Units: (kg/(ft·s²)). |
|  | WidthOrDiameter | The diameter of the duct with round profile, or the width of the duct with other profiles. Units: (ft). |

Top See Also

#### Reference

DuctPressureDropData Class Autodesk.Revit.DB.Mechanical Namespace